; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v10 ?v2)
             (pred_10 ?v6 ?v13)
             (pred_1 ?v10 ?v13)
             (pred_6 ?v11 ?v10 )
	     (pred_9 ?v10)
             (pred_3 ?v9)
             (pred_4 ?v6)
             (pred_7 ?v13)
             (pred_11 ?v10)
             (pred_5 ?v6)
             (pred_2 ?v10)
             (pred_12 ))



(:action op_5
:parameters (?v8 ?v7 ?v12 ?v1)
:precondition (and (pred_3 ?v8) (pred_3 ?v7) (pred_4 ?v12) (pred_7 ?v1)
          (pred_8 ?v8 ?v7) (pred_10 ?v12 ?v1)
                   (pred_1 ?v7 ?v1) (pred_9 ?v8) 
                   (pred_11 ?v7) (pred_5 ?v12))
:effect (and  (pred_2 ?v7) (not (pred_11 ?v7))))


(:action op_1
:parameters (?v8 ?v5)
:precondition (and (pred_3 ?v8) (pred_3 ?v5)
               (pred_9 ?v8) (pred_8 ?v8 ?v5) (pred_2 ?v5))
:effect (and (pred_9 ?v5) (not (pred_9 ?v8))))

(:action op_2
:parameters (?v8 ?v12)
:precondition (and (pred_3 ?v8) (pred_4 ?v12) 
                  (pred_9 ?v8) (pred_6 ?v12 ?v8) (pred_12 ))
:effect (and (pred_5 ?v12)
   (not (pred_6 ?v12 ?v8)) (not (pred_12 ))))


(:action op_4
:parameters (?v8 ?v4 ?v3)
:precondition (and (pred_3 ?v8) (pred_4 ?v4) (pred_4 ?v3)
                  (pred_9 ?v8) (pred_5 ?v3) (pred_6 ?v4 ?v8))
:effect (and (pred_5 ?v4) (pred_6 ?v3 ?v8)
        (not (pred_5 ?v3)) (not (pred_6 ?v4 ?v8))))

(:action op_3
:parameters (?v8 ?v12)
:precondition (and (pred_3 ?v8) (pred_4 ?v12) 
                  (pred_9 ?v8) (pred_5 ?v12))
:effect (and (pred_12 ) (pred_6 ?v12 ?v8) (not (pred_5 ?v12)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_09 obj_08 obj_11 obj_13 obj_07 obj_03 obj_12 obj_05 obj_02
    obj_06 obj_10
    obj_01 obj_04
    )

    (:init
       (pred_12)

       (pred_3 obj_09)
       (pred_3 obj_08)
       (pred_3 obj_11)
       (pred_3 obj_13)
       (pred_3 obj_07)
       (pred_3 obj_03)
       (pred_3 obj_12)
       (pred_3 obj_05)
       (pred_3 obj_02)
       (pred_7 obj_06)
       (pred_7 obj_10)
       (pred_4 obj_01)
       (pred_4 obj_04)

       (pred_8 obj_09 obj_13)
       (pred_8 obj_09 obj_08)
       (pred_8 obj_08 obj_07)
       (pred_8 obj_08 obj_11)
       (pred_8 obj_08 obj_09)
       (pred_8 obj_11 obj_03)
       (pred_8 obj_11 obj_08)
       (pred_8 obj_13 obj_12)
       (pred_8 obj_13 obj_07)
       (pred_8 obj_13 obj_09)
       (pred_8 obj_07 obj_05)
       (pred_8 obj_07 obj_03)
       (pred_8 obj_07 obj_08)
       (pred_8 obj_07 obj_13)
       (pred_8 obj_03 obj_02)
       (pred_8 obj_03 obj_11)
       (pred_8 obj_03 obj_07)
       (pred_8 obj_12 obj_05)
       (pred_8 obj_12 obj_13)
       (pred_8 obj_05 obj_02)
       (pred_8 obj_05 obj_07)
       (pred_8 obj_05 obj_12)
       (pred_8 obj_02 obj_03)
       (pred_8 obj_02 obj_05)
       (pred_11 obj_09)
       (pred_11 obj_13)
       (pred_1  obj_09 obj_06)
       (pred_1  obj_13 obj_10)
       (pred_2 obj_08)
       (pred_2 obj_11)
       (pred_2 obj_07)
       (pred_2 obj_03)
       (pred_2 obj_12)
       (pred_2 obj_05)
       (pred_2 obj_02)

       (pred_10  obj_01 obj_06)
       (pred_10  obj_04 obj_10)
       (pred_6 obj_01 obj_02)
       (pred_6 obj_04 obj_02)
       (pred_9 obj_05)
    )

    (:goal (and
       (pred_6 obj_04 obj_11)
    ))
(:constraints
  (always (not (pred_9 obj_03)))
)
)

; plan
1. (op_1 obj_05 obj_02)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_02)
   goals met: 0 of 1
2. (op_2 obj_02 obj_04)
   deleted: (pred_6 obj_04 obj_02) (pred_12)
   added: (pred_5 obj_04)
   goals met: 0 of 1
3. (op_1 obj_02 obj_05)
   deleted: (pred_9 obj_02)
   added: (pred_9 obj_05)
   goals met: 0 of 1
4. (op_1 obj_05 obj_07)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_07)
   goals met: 0 of 1
5. (op_1 obj_07 obj_08)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_08)
   goals met: 0 of 1
6. (op_1 obj_08 obj_11)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_11)
   goals met: 0 of 1
7. (op_3 obj_11 obj_04)
   deleted: (pred_5 obj_04)
   added: (pred_12) (pred_6 obj_04 obj_11)
   goals met: 1 of 1
